{
  "projectBrief": {
    "name": "Subflow",
    "tagline": "Платформа аналітики підписок",
    "type": "B2B SaaS (web application)",
    "context": "Subflow — це B2B SaaS-додаток, який допомагає компаніям відстежувати, аналізувати та оптимізувати свої підписки. Стартап отримав початкове фінансування та має амбітну мету запуску MVP за 12 тижнів для захоплення раннього ринку.",
    "deadline": "12 weeks (fixed, tied to investor meeting)",
    "budget": "$100,000 (locked, covers team salaries + infrastructure)",
    "client": {
      "name": "David Chen",
      "role": "CEO & Founder",
      "description": "Technical background, first-time founder, under board pressure"
    },
    "team": [
      {
        "name": "Яна",
        "role": "Дизайнерка",
        "trait": "Перфекціоністка, захисниця користувачів"
      },
      {
        "name": "Максим",
        "role": "Backend-розробник",
        "trait": "Технічно сильний, але схильний до надмірної інженерії"
      },
      {
        "name": "Олена",
        "role": "Frontend-розробниця",
        "trait": "Швидка, але буває пропускає деталі"
      },
      {
        "name": "Андрій",
        "role": "Засновник/CEO",
        "trait": "Візіонер з постійними ідеями про нові фічі"
      }
    ],
    "risk": "Investors expect live demo with real customer data in Week 12. No second chance.",
    "keyRisks": [
      "Агресивний дедлайн з можливістю scope creep",
      "Перша спільна робота команди",
      "Обмежений бюджет — перевитрата означає відсутність Series A"
    ],
    "yourChallenge": "Керувати командою через 12-тижневий шлях до MVP, балансуючи якість, швидкість та задоволеність команди. Кожне твоє рішення впливає на довіру клієнта, настрій команди, технічний борг та ризик таймлайну."
  },
  "weeks": [
    {
      "weekNumber": 1,
      "phase": "Requirements & Design",
      "title": "Все критично",
      "context": "Перший тиждень, і вже виникла проблема. Андрій (CEO) надіслав список з 47 фіч для MVP. Яна (дизайнерка) налаштована скептично. Максим та Олена (розробники) виглядають переляканими.",
      "signals": [
        {
          "person": "Андрій",
          "message": "@всі Ось список must-have фіч для MVP! Я знаю, що це багато, але всі вони критичні для наших ранніх клієнтів.",
          "sentiment": "excited"
        },
        {
          "person": "Яна",
          "message": "47 фіч за 12 тижнів? Нам потрібен чіткий пріоритет, щоб створити щось використовуване.",
          "sentiment": "concerned"
        },
        {
          "person": "Максим",
          "message": "Деякі з цих фіч потребують складних інтеграцій. Потрібно реально оцінити, що можливо.",
          "sentiment": "worried"
        }
      ],
      "situation": "The backlog is overwhelming. The team needs direction. David expects everything. You know \"everything\" means nothing gets done properly. No one has challenged David yet.",
      "options": [
        {
          "id": "A",
          "text": "Погодитися з усіма 47 фічами, щоб зробити Андрія щасливим",
          "consequence": "Андрій в захваті, але команда відчуває себе приреченою. Ніхто не вірить, що це реально.",
          "metrics": {
            "clientTrust": 5,
            "teamMood": -15,
            "techDebt": 10,
            "timelineRisk": 20
          }
        },
        {
          "id": "B",
          "text": "Провести воркшоп з пріоритизації, використовуючи MoSCoW або подібну техніку",
          "consequence": "Команда співпрацює над реалістичним скоупом. Андрій розчарований, але розуміє обґрунтування.",
          "metrics": {
            "clientTrust": -5,
            "teamMood": 10,
            "techDebt": -5,
            "timelineRisk": -10
          }
        },
        {
          "id": "C",
          "text": "Вибрати топ-10 фіч на власний розсуд і представити як \"Фаза 1\"",
          "consequence": "Швидке рішення, але Андрій відчуває себе виключеним. Команда невпевнена в пріоритетах.",
          "metrics": {
            "clientTrust": -10,
            "teamMood": 0,
            "techDebt": 0,
            "timelineRisk": -5
          }
        },
        {
          "id": "D",
          "text": "Попросити Андрія ранжувати фічі, потім провести сесію оцінки команди",
          "consequence": "Збалансований підхід. Андрій залучений, команда має голос. Потребує часу, але будує вирівнювання.",
          "metrics": {
            "clientTrust": 0,
            "teamMood": 5,
            "techDebt": -5,
            "timelineRisk": -5
          }
        }
      ]
    },
    {
      "weekNumber": 2,
      "phase": "Requirements & Design",
      "title": "Вузьке місце дизайну",
      "context": "Яна витратила весь тиждень на удосконалення однієї UI-компоненти. Її робота бездоганна, але розробники чекають на вайрфрейми для інших екранів. Перший спринт під загрозою.",
      "signals": [
        {
          "person": "Олена",
          "message": "Мені потрібні дизайни для сторінки налаштувань, щоб триматися графіка. @Яна коли вони будуть готові?",
          "sentiment": "impatient"
        },
        {
          "person": "Яна",
          "message": "Працюю над досконалістю дашборду. Цей екран — те, що побачать інвестори. Потрібен час, щоб зробити правильно.",
          "sentiment": "defensive"
        },
        {
          "person": "Максим",
          "message": "Можу почати з бекенду, але було б добре мати повну картину дизайну скоро.",
          "sentiment": "neutral"
        }
      ],
      "situation": "Olena's approach is right long-term, but you're losing velocity. Maksym is frustrated. David wants to see progress. You have a call tomorrow with nothing visual to show.",
      "options": [
        {
          "id": "A",
          "text": "Дати Яні ще тиждень — якість важливіша за швидкість на цьому етапі",
          "consequence": "Дизайн виходить чудовим, але розробка затримується. Перший спринт провалено.",
          "metrics": {
            "clientTrust": 0,
            "teamMood": -5,
            "techDebt": 5,
            "timelineRisk": 10
          }
        },
        {
          "id": "B",
          "text": "Попросити Яну перейти на швидші, менш відшліфовані дизайни для прогресу",
          "consequence": "Яна відчуває, що її не цінують. Дизайни \"достатньо хороші\" але не чудові.",
          "metrics": {
            "clientTrust": 0,
            "teamMood": -10,
            "techDebt": 0,
            "timelineRisk": -5
          }
        },
        {
          "id": "C",
          "text": "Впровадити дизайн-спринти з таймбоксами для кожної компоненти",
          "consequence": "Структура допомагає, але Яна відчуває поспіх. Баланс швидкості та якості.",
          "metrics": {
            "clientTrust": 0,
            "teamMood": 0,
            "techDebt": 0,
            "timelineRisk": -5
          }
        },
        {
          "id": "D",
          "text": "Обговорити з Яною, що \"досконалість — ворог готового\" та узгодити пріоритети",
          "consequence": "Яна розуміє компроміс. Узгоджує реалістичний графік із \"достатньо хорошими\" дизайнами.",
          "metrics": {
            "clientTrust": 0,
            "teamMood": 5,
            "techDebt": 0,
            "timelineRisk": -10
          }
        }
      ]
    },
    {
      "weekNumber": 3,
      "phase": "Requirements & Design",
      "title": "Несподівана фіча",
      "context": "Андрій повернувся з конференції, надихнутий конкурентом. Хоче додати AI-рекомендації до нашого MVP. Команда вже завантажена узгодженим скоупом.",
      "signals": [
        {
          "person": "Андрій",
          "message": "Тільки що бачив демо конкурента з AI-підказками. Це game changer! Нам ПОТРІБНО це в MVP.",
          "sentiment": "excited"
        },
        {
          "person": "Максим",
          "message": "AI-інтеграція не тривіальна. Це додасть тижні до розробки, плюс треба вибрати та налаштувати модель.",
          "sentiment": "stressed"
        },
        {
          "person": "Яна",
          "message": "Ми ще не розібралися з основними UX флоу. Додавання AI зараз ускладнить все.",
          "sentiment": "frustrated"
        }
      ],
      "situation": "David just added 2-3 weeks of work publicly. Team is waiting for your response. He framed it as \"customer need\" so it's hard to refuse. But you have 9 weeks left and already tight scope.",
      "options": [
        {
          "id": "A",
          "text": "Погодитися на AI-фічу — Андрій як CEO знає ринок краще",
          "consequence": "Скоуп розширюється. Команда перевантажена, але Андрій вдоволений.",
          "metrics": {
            "clientTrust": 10,
            "teamMood": -15,
            "techDebt": 15,
            "timelineRisk": 20
          }
        },
        {
          "id": "B",
          "text": "Відмовити та захистити початковий скоуп",
          "consequence": "Команда полегшена, але Андрій відчуває, що його не чують. Напруга зростає.",
          "metrics": {
            "clientTrust": -15,
            "teamMood": 10,
            "techDebt": 0,
            "timelineRisk": 0
          }
        },
        {
          "id": "C",
          "text": "Запропонувати додати AI після MVP як \"Фазу 2\" фічу",
          "consequence": "Компроміс, який дає команді простір для подиху. Андрій не в захваті, але погоджується.",
          "metrics": {
            "clientTrust": -5,
            "teamMood": 5,
            "techDebt": 0,
            "timelineRisk": 0
          }
        },
        {
          "id": "D",
          "text": "Запропонувати базову версію AI (наприклад, проста система рекомендацій на основі правил)",
          "consequence": "Креативне рішення. Більше роботи, але керовано. Андрій задоволений, команда напружена, але справляється.",
          "metrics": {
            "clientTrust": 5,
            "teamMood": -5,
            "techDebt": 10,
            "timelineRisk": 10
          }
        }
      ]
    },
    {
      "weekNumber": 4,
      "phase": "Development",
      "title": "Тихий блокер",
      "context": "Максим застряг на складній API-інтеграції вже 3 дні, але не просив допомоги. Його таски червоні на борді. Інші члени команди не знають про проблему.",
      "signals": [
        {
          "person": "Олена",
          "message": "Чекаю на API Максима, щоб закінчити свій фронтенд. @Максим як прогрес?",
          "sentiment": "waiting"
        },
        {
          "person": "Максим",
          "message": "Скоро буде. Вирішую кілька проблем.",
          "sentiment": "vague"
        },
        {
          "person": "Яна",
          "message": "Помітила, що ті самі таски червоні вже кілька днів. Все ок, Максиме?",
          "sentiment": "concerned"
        }
      ],
      "situation": "Maksym lost 3 days waiting for an endpoint that won't be ready for another week. Yana is blocked on external approval. The sprint is derailing. No one escalated early. Everyone thought it would resolve itself.",
      "options": [
        {
          "id": "A",
          "text": "Довіряти Максиму — він досвідчений розробник, сам впорається",
          "consequence": "Максим продовжує боротися наодинці. Затримка поглиблюється. Інтеграція займає ще тиждень.",
          "metrics": {
            "clientTrust": 0,
            "teamMood": -5,
            "techDebt": 10,
            "timelineRisk": 15
          }
        },
        {
          "id": "B",
          "text": "Публічно конфронтувати його на стендапі про затримку",
          "consequence": "Максим відчуває себе викритим. Визнає проблему, але моральний дух пошкоджено.",
          "metrics": {
            "clientTrust": 0,
            "teamMood": -15,
            "techDebt": 0,
            "timelineRisk": -5
          }
        },
        {
          "id": "C",
          "text": "Провести приватну 1-on-1 зустріч, щоб зрозуміти блокер",
          "consequence": "Максим відкривається про технічні виклики. Разом знаходите рішення або допомогу.",
          "metrics": {
            "clientTrust": 0,
            "teamMood": 10,
            "techDebt": -5,
            "timelineRisk": -10
          }
        },
        {
          "id": "D",
          "text": "Призначити Олену допомогти йому (парне програмування)",
          "consequence": "Вони вирішують це разом, але Олена відстає від своїх тасок. Компроміс.",
          "metrics": {
            "clientTrust": 0,
            "teamMood": 5,
            "techDebt": -5,
            "timelineRisk": 5
          }
        }
      ]
    },
    {
      "weekNumber": 5,
      "phase": "Development",
      "title": "Тихий бунт",
      "context": "Команда почала пропускати стендапи. Повідомлення в Slack стають коротшими. Ніхто прямо не скаржиться, але енергія впала. Ви відчуваєте опір.",
      "signals": [
        {
          "person": "Олена",
          "message": "[Пропустила ранковий стендап]",
          "sentiment": "absent"
        },
        {
          "person": "Максим",
          "message": "Працюватиму над функціоналом. Оновлю в кінці дня.",
          "sentiment": "distant"
        },
        {
          "person": "Яна",
          "message": "[Онлайн, але не відповідає на повідомлення]",
          "sentiment": "withdrawn"
        }
      ],
      "situation": "There's a philosophical split. Maksym and Yana want feature velocity. Andriy and Olena want quality. Both are right. You have 7 weeks. If you slow down for bugs now, you might not finish features. If you ignore bugs, demo will look broken.",
      "options": [
        {
          "id": "A",
          "text": "Посилити процес — обов'язкові стендапи, більше чекінів",
          "consequence": "Команда дотримується правил, але відчуває мікроменеджмент. Моральний дух падає далі.",
          "metrics": {
            "clientTrust": 0,
            "teamMood": -20,
            "techDebt": 0,
            "timelineRisk": 10
          }
        },
        {
          "id": "B",
          "text": "Організувати ретроспективу середини спринту, щоб озвучити проблеми",
          "consequence": "Команда розкриває вигорання та фрустрації. Важка розмова, але катарсична.",
          "metrics": {
            "clientTrust": 0,
            "teamMood": 15,
            "techDebt": 0,
            "timelineRisk": 0
          }
        },
        {
          "id": "C",
          "text": "Ігнорувати це — вони професіонали, доставлятимуть незалежно від настрою",
          "consequence": "Продуктивність знижується. Команда відчуває себе нечуваною. Токсичність наростає.",
          "metrics": {
            "clientTrust": 0,
            "teamMood": -15,
            "techDebt": 10,
            "timelineRisk": 15
          }
        },
        {
          "id": "D",
          "text": "Влаштувати неформальний тімбілдінг (віртуальна кава, гра, тощо)",
          "consequence": "Легке покращення настрою, але корінні проблеми не вирішені. Тимчасове полегшення.",
          "metrics": {
            "clientTrust": 0,
            "teamMood": 5,
            "techDebt": 0,
            "timelineRisk": 0
          }
        }
      ]
    },
    {
      "weekNumber": 6,
      "phase": "Development",
      "title": "Сумніви засновника",
      "context": "Андрій надіслав нічне повідомлення, що він \"не впевнений у напрямку продукту\". Хоче переглянути дизайн і можливо змінити ціле ціннісне твердження. Команда вже на півдорозі.",
      "signals": [
        {
          "person": "Андрій",
          "message": "[2:34 AM] Не можу спати. Думаю, ми вирішуємо не ту проблему. Що якщо ми сфокусуємося на малому бізнесі замість enterprise?",
          "sentiment": "panicking"
        },
        {
          "person": "Яна",
          "message": "Який?! Ми на 6 тижні. Зміна цільового ринку зараз означає перероблення всього.",
          "sentiment": "alarmed"
        },
        {
          "person": "Максим",
          "message": "Я розумію сумніви, але ми маємо реальний прогрес. Чи не краще закінчити це і обернути на v2?",
          "sentiment": "rational"
        }
      ],
      "situation": "David is having a crisis of confidence. The team is executing well, unaware of his doubts. If you tell them, morale collapses. If you don't, you might be building the wrong thing. You have no authority to override his strategic decisions.",
      "options": [
        {
          "id": "A",
          "text": "Підтримати розворот Андрія — він бачить ринок, якого ми не бачимо",
          "consequence": "Масштабна переробка. Команда деморалізована. Таймлайн зривається.",
          "metrics": {
            "clientTrust": 5,
            "teamMood": -25,
            "techDebt": 20,
            "timelineRisk": 40
          }
        },
        {
          "id": "B",
          "text": "Відштовхнути жорстко — нагадати про зобов'язання та витрачений час",
          "consequence": "Андрій відчуває себе закритим. Продовжує, але відлучено. Довіра пошкоджена.",
          "metrics": {
            "clientTrust": -20,
            "teamMood": 5,
            "techDebt": 0,
            "timelineRisk": 0
          }
        },
        {
          "id": "C",
          "text": "Запропонувати швидкий експеримент для тестування його нової гіпотези (наприклад, опитування)",
          "consequence": "Дані показують, що поточний напрям твердий. Андрій заспокоєний без зривання плану.",
          "metrics": {
            "clientTrust": 5,
            "teamMood": 5,
            "techDebt": 0,
            "timelineRisk": 5
          }
        },
        {
          "id": "D",
          "text": "Зателефонувати йому наступного ранку для структурованої дискусії",
          "consequence": "Андрій визнає нічну паніку. Узгоджує продовження курсу з дрібними коригуваннями.",
          "metrics": {
            "clientTrust": 0,
            "teamMood": 10,
            "techDebt": 0,
            "timelineRisk": -5
          }
        }
      ]
    }
  ],
  "finalReview": {
    "title": "Підсумки проєкту",
    "outcomeTitle": "Ваш результат",
    "outcomeText": "Базуючись на ваших рішеннях протягом 6 тижнів, ось як розгорнувся ваш проєкт...",
    "reflectionText": "Управління проєктами — це не про ідеальні рішення. Це про навігацію у невизначеності, балансування конкуруючих пріоритетів та побудову довіри з вашою командою та стейкхолдерами. Кожен вибір має наслідки — іноді видимі відразу, іноді тільки згодом."
  }
}