{
  "projectBrief": {
    "name": "Subflow",
    "tagline": "Платформа аналітики підписок",
    "type": "B2B SaaS (веб-додаток)",
    "context": "Стартап серії А (залучено $5 млн). Розробка аналітичної панелі для бізнесів із передплатою. Минулого кварталу два конкуренти запустили схожі продукти. Інвестори очікують готовий до демонстрації MVP через 12 тижнів для пітчу серії B.",
    "deadline": "12 тижнів (фіксований термін, прив'язаний до зустрічі з інвесторами)",
    "budget": "$100,000 (фіксований, покриває зарплати команди + інфраструктуру)",
    "client": {
      "name": "Девід Чен",
      "role": "CEO та засновник",
      "description": "Технічний бекграунд, засновник-новачок, перебуває під тиском ради директорів"
    },
    "team": [
      {
        "name": "Яна",
        "role": "Senior Backend Developer",
        "experience": "5 років",
        "personality": "Прагматична, іноді песимістична"
      },
      {
        "name": "Максим",
        "role": "Mid Frontend Developer",
        "experience": "3 роки",
        "personality": "Енергійний, оптимістичний, з мисленням джуніора"
      },
      {
        "name": "Олена",
        "role": "Product Designer",
        "experience": "4 роки",
        "personality": "Перфекціоністка, повільна, але орієнтована на якість"
      },
      {
        "name": "Андрій",
        "role": "QA Engineer",
        "experience": "2 роки",
        "personality": "Уважний до деталей, уникає ризиків"
      }
    ],
    "risk": "Інвестори очікують "живу" демонстрацію з реальними даними клієнтів на 12-му тижні. Другого шансу не буде."
  },
  "weeks": [
    {
      "weekNumber": 1,
      "phase": "Вимоги та Дизайн",
      "title": "Все критично важливо",
      "context": "Ранок понеділка. Щойно закінчився кікофф-колл. Девід надіслав PRD на 23 сторінки за вихідні. Ви відкрили його в неділю ввечері. Там є все: автентифікація, дашборд, інтеграція зі Stripe, аналітичний двигун, експорт в Excel, email-сповіщення, ролі користувачів, доступ до API.\n\nКоманда мовчить у Slack. Олена запитала: \"З чого починаємо?\". Поки ніхто не відповів.\n\nУ беклозі 47 юзер-сторі. Девід тричі під час дзвінка повторив: \"це все критично важливо\". Яна написала вам в особисті: \"Це робота на шість місяців, а не на три\".",
      "signals": [
        {
          "from": "Девід Чен (CEO)",
          "time": "9:15 AM",
          "avatar": "👔",
          "message": "Просто підтверджую — ми ж починаємо з повним обсягом, так? Я знаю, що це амбітно, але інвесторам потрібно бачити бачення."
        },
        {
          "from": "Олена (Дизайнер)",
          "time": "9:47 AM",
          "avatar": "🎨",
          "message": "Мені потрібна ясність щодо пріоритетів. Якщо все критично, я спроєктую все поверхнево. Якщо ми зосередимося, я зможу глибоко опрацювати 3-4 флоу. Твоє рішення."
        },
        {
          "from": "Яна (Backend)",
          "time": "11:32 AM",
          "avatar": "⚙️",
          "message": "(немає повідомлень)"
        },
        {
          "from": "Максим (Frontend)",
          "time": "2:18 PM",
          "avatar": "💻",
          "message": "Я в захваті! Коли ми отримаємо дизайни? Я можу принаймні почати зі сторінки логіну."
        }
      ],
      "situation": "Беклог перевантажений. Команді потрібен напрямок. Девід очікує все. Ви знаєте, що \"все\" означає, що нічого не буде зроблено належним чином. Поки що ніхто не кинув виклик Девіду.",
      "options": [
        {
          "id": "A",
          "title": "Прийняти повний обсяг",
          "description": "Сказати команді, що ми спробуємо реалізувати все, почати паралельну роботу над усіма функціями.",
          "shortConsequence": "Команда відчує довіру, але буде перевантажена",
          "consequences": {
            "immediate": "Команда починає працювати над усім одночасно. Максим береться за сторінку логіну. Олена починає малювати кілька флоу одночасно. Яна розробляє архітектуру бази даних для всіх функцій. Усі зайняті, але ніхто не сфокусований. До п’ятниці у вас 12 справ у роботі, і жодна не завершена.",
            "metrics": {
              "clientTrust": 15,
              "teamMood": -20,
              "techDebt": -10,
              "timelineRisk": -25
            },
            "hidden": "Тиждень 4: Яна скаже, що напівготові функції блокують одна одну. Тиждень 6: Починається вигорання команди."
          }
        },
        {
          "id": "B",
          "title": "Дати відсіч зараз",
          "description": "Призначити дзвінок із Девідом, показати реальність 6-місячного графіка, домовитися про скорочення обсягу.",
          "shortConsequence": "Ризик раннього конфлікту, але отримання ясності",
          "consequences": {
            "immediate": "Девід спочатку захищається, але поважає чесність. Ви витрачаєте 2 дні на створення реалістичного графіка. Девід погоджується скоротити 40% обсягу. Команда відчуває полегшення та фокусується. Ви втрачаєте 2 дні, але виграєте 3 тижні цілеспрямованої роботи.",
            "metrics": {
              "clientTrust": -10,
              "teamMood": 20,
              "techDebt": 10,
              "timelineRisk": 15
            },
            "hidden": "Тиждень 8: Девід засумнівається в цьому рішенні, коли конкуренти запустять функції, які ви вирізали."
          }
        },
        {
          "id": "C",
          "title": "Будувати \"MVP всередині MVP\" таємно",
          "description": "Публічно погодитися, але спрямувати команду на 3 основні функції, тримаючи інші в статусі \"в роботі\".",
          "shortConsequence": "Команда отримує фокус, але Девід очікує на все",
          "consequences": {
            "immediate": "Ви приватно кажете команді зосередитися на дашборді, інтеграції зі Stripe та аналітиці. Публічно ви оновлюєте Девіда про \"прогрес\" по всіх фічах. У команди є ясність. Девід залишається оптимістом. Але прірва між очікуваннями та реальністю зростає.",
            "metrics": {
              "clientTrust": 5,
              "teamMood": 10,
              "techDebt": 0,
              "timelineRisk": -15
            },
            "hidden": "Тиждень 9: Девід виявить розрив під час демонстрації раді директорів. Занадто пізно для стратегічних змін."
          }
        },
        {
          "id": "D",
          "title": "Запросити 2-денний \"спринт нуль\"",
          "description": "Відкласти старт, провести воркшоп з оцінки з командою, представити графік Девіду в п'ятницю.",
          "shortConsequence": "Втрата 2 днів, але отримання реалістичного плану",
          "consequences": {
            "immediate": "Команда витрачає вівторок-середу на належну оцінку. Ви представляєте реалістичний 18-тижневий план Девіду в п'ятницю. Він шокований, але цінує прозорість. Ви переглядаєте умови: 12-тижневий MVP з дорожньою картою для фази 2. Команда відчуває, що їх почули.",
            "metrics": {
              "clientTrust": 0,
              "teamMood": 15,
              "techDebt": 5,
              "timelineRisk": 10
            },
            "hidden": "Тиждень 11: У вас буде 1 тиждень буфера. Це врятує проєкт, коли Stripe API вийде з ладу."
          }
        }
      ]
    },
    {
      "weekNumber": 2,
      "phase": "Вимоги та Дизайн",
      "title": "Вузьке місце дизайну",
      "context": "Минулого тижня ви обрали свій шлях. Олена була тихою весь тиждень. Ви перевірили стан справ учора. Вона сказала, що \"працює над дизайн-системою спочатку — інакше пізніше буде неузгоджений інтерфейс\". Вона права. Але Максим сидить без роботи вже три дні. Він постійно запитує: \"Коли я зможу почати кодити?\".\n\nЯна почала архітектуру бекенду. Вона не чекає на дизайн. Але фронтенд заблокований.\n\nЧетвер по обіді. Девід написав: \"Чи можу я побачити дизайни завтра?\"",
      "signals": [
        {
          "from": "Олена (Дизайнер)",
          "time": "10:23 AM",
          "avatar": "🎨",
          "message": "Мені потрібен ще тиждень для дизайн-системи. Кнопки, інпути, кольори, відступи. Інакше Максим побудує неузгоджений UI, і ми будемо робити рефакторинг вічно."
        },
        {
          "from": "Максим (Frontend)",
          "time": "11:45 AM",
          "avatar": "💻",
          "message": "Я буквально просто сиджу. Можу я хоча б сторінку логіну зробити? Мені для цього не потрібні повні дизайни."
        },
        {
          "from": "Яна (Backend)",
          "time": "1:02 PM",
          "avatar": "⚙️",
          "message": "Структура бекенду готова. Переходжу до інтеграції зі Stripe. Дайте знати, коли фронтенд буде розблоковано."
        },
        {
          "from": "Девід Чен (CEO)",
          "time": "4:37 PM",
          "avatar": "👔",
          "message": "Швидкий синк завтра о 10 ранку? Хочу побачити, де ми. Інвестори ставлять запитання."
        }
      ],
      "situation": "Підхід Олени правильний у довгостроковій перспективі, але ви втрачаєте швидкість. Максим розчарований. Девід хоче бачити прогрес. У вас завтра дзвінок, а показати нічого візуального.",
      "options": [
        {
          "id": "A",
          "title": "Повністю підтримати Олену",
          "description": "Сказати Девіду, що дизайн-система є фундаментом, перенести синк на наступний тиждень, захистити графік Олени.",
          "shortConsequence": "Правильне рішення, але немає видимого прогресу",
          "consequences": {
            "immediate": "Девід розчарований, але довіряє вам. Олена закінчує дизайн-систему до наступного тижня. Вона красива та цілісна. Але ви втратили 2 тижні розробки фронтенду. Ентузіазм Максима згасає. Команда сумнівається, чи встигнете ви до дедлайну.",
            "metrics": {
              "clientTrust": -15,
              "teamMood": 5,
              "techDebt": 15,
              "timelineRisk": -20
            },
            "hidden": "Тиждень 10: Ідеальний UI вразить інвесторів під час демо. Ця інвестиція окупиться."
          }
        },
        {
          "id": "B",
          "title": "Натиснути на Олену, щоб вона щось видала",
          "description": "Попросити її пропустити дизайн-систему, намалювати 2-3 екрани до завтра, систему можна доробити пізніше.",
          "shortConsequence": "Короткостроковий прогрес, довгострокова неузгодженість",
          "consequences": {
            "immediate": "Олена працює всю ніч, видає 3 екрани. Девід задоволений. Максим одразу починає кодити. Але UI-компоненти неузгоджені. Тиждень 6: ви витратите 2 тижні на рефакторинг фронтенду, бо кнопки та кольори скрізь різні.",
            "metrics": {
              "clientTrust": 10,
              "teamMood": -10,
              "techDebt": -20,
              "timelineRisk": 5
            },
            "hidden": "Тиждень 6: Рефакторинг коштуватиме 2 тижні. Помилки в UI переслідуватимуть вас до запуску."
          }
        },
        {
          "id": "C",
          "title": "Розблокувати Максима чернетками",
          "description": "Сказати Олені дати Максиму лоу-фай вайрфрейми, він будує базу, вона допрацює пізніше.",
          "shortConsequence": "Паралельна робота, але можливі переробки",
          "consequences": {
            "immediate": "Олена дає Максиму вайрфрейми за 2 години. Він починає будувати з плейсхолдерами замість стилів. Прогрес помітний. Олена продовжує роботу над дизайн-системою паралельно. Потрібні невеликі переробки, але не катастрофічні. Девід бачить рух.",
            "metrics": {
              "clientTrust": 5,
              "teamMood": 10,
              "techDebt": -10,
              "timelineRisk": 0
            },
            "hidden": "Тиждень 8: Ви витратите 1 тиждень на візуальний рефакторинг. Не ідеально, але керовано."
          }
        },
        {
          "id": "D",
          "title": "Показати Девіду прогрес бекенду",
          "description": "Пропустити демо дизайну, показати йому архітектуру API, схему бази даних, технічний фундамент.",
          "shortConsequence": "Він може цього не зрозуміти",
          "consequences": {
            "immediate": "Девід приєднується до дзвінка. Ви показуєте діаграми БД та документацію API. Він ввічливо киває, але виглядає розгубленим. Після дзвінка він пише співзасновнику: \"Не впевнений, що у них є реальний прогрес\". Довіра падає.",
            "metrics": {
              "clientTrust": -20,
              "teamMood": -5,
              "techDebt": 5,
              "timelineRisk": -5
            },
            "hidden": "Тиждень 7: Девід почне більше мікроменеджити після цього. Зайві зустрічі, звіти про статус."
          }
        }
      ]
    },
    {
      "weekNumber": 3,
      "phase": "Вимоги та Дизайн",
      "title": "Раптова функція",
      "context": "Ви зробили вибір щодо дизайну. Справи рухаються. Максим кодить. Яна занурена в інтеграцію зі Stripe. Андрій пише тест-плани.\n\nРанок п'ятниці. Ви переглядаєте прогрес спринту. Відчуваєте стриманий оптимізм.\n\nРаптом Девід пише у загальний канал. Не в особисті. Публічне повідомлення: \"Вчора спілкувався з потенційним клієнтом. Їм потрібен імпорт CSV для історичних даних. Без цього вони не перейдуть з поточного інструменту. Це вирішальний фактор\".\n\nУ кімнаті стає холодно. Імпорту CSV не було в початковому плані. Яна відповідає миттєво: \"Це 2-3 тижні роботи. Парсинг, валідація, обробка помилок, UI для завантаження\".\n\nДевід відповідає: \"Але це ж просто читання файлу, хіба ні?\"",
      "signals": [
        {
          "from": "Девід Чен (CEO)",
          "time": "9:18 AM",
          "avatar": "👔",
          "message": "Я знаю, що ми цього не планували, але фідбек клієнтів — це золото. Ми не можемо втратити нашого першого пілотного користувача через відсутню функцію."
        },
        {
          "from": "Яна (Backend)",
          "time": "9:21 AM",
          "avatar": "⚙️",
          "message": "Парсинг CSV складний. Погані дані, різні формати, спецсимволи. Потім валідація, ролбек у разі помилки. Це не проста фіча."
        },
        {
          "from": "Максим (Frontend)",
          "time": "9:35 AM",
          "avatar": "💻",
          "message": "Я можу зробити UI завантаження за день. Але обробка на бекенді — це рішення Яни."
        },
        {
          "from": "Олена (Дизайнер)",
          "time": "10:12 AM",
          "avatar": "🎨",
          "message": "А у нас є дизайни для станів помилок? Прогрес завантаження? Екран із вимогами до формату? Це потребує UX-роботи."
        }
      ],
      "situation": "Девід публічно додав 2-3 тижні роботи. Команда чекає на вашу реакцію. Він подав це як \"потребу клієнта\", тому відмовити важко. Але у вас залишилося 9 тижнів і дуже щільний графік.",
      "options": [
        {
          "id": "A",
          "title": "Прийняти, скоригувати графік",
          "description": "Сказати Девіду \"так\", але перенести дедлайн АБО вирізати інші функції. Зробити компроміс явним.",
          "shortConsequence": "Він може відмовитися, але це чесно",
          "consequences": {
            "immediate": "Ви призначаєте 1-на-1 з Девідом. Пропонуєте два варіанти: перенести демо на 14-й тиждень або прибрати функцію управління користувачами. Йому незручно, але він обирає прибрати управління користувачами. Команда цінує вашу стійкість. Стосунки з клієнтом міцні. Але демо буде без ролей користувачів.",
            "metrics": {
              "clientTrust": 10,
              "teamMood": 15,
              "techDebt": -5,
              "timelineRisk": 0
            },
            "hidden": "Демо 12-го тижня: Інвестор запитає: \"Де управління користувачами?\". Девіду доведеться пояснювати."
          }
        },
        {
          "id": "B",
          "title": "Сказати \"так\", якось втиснути",
          "description": "Сказати команді \"зробіть це\", сподіватися на овертайми або швидкі рішення.",
          "shortConsequence": "Команда вигорить або впаде якість",
          "consequences": {
            "immediate": "Команда працює понаднормово. Імпорт CSV будується за 10 днів ночами та на вихідних. Функція працює, але якість коду низька. Максим вигорає до 7-го тижня. Яна обурена. Техборг накопичується. Фіча крихка і зламається під час демо.",
            "metrics": {
              "clientTrust": 15,
              "teamMood": -25,
              "techDebt": -30,
              "timelineRisk": -20
            },
            "hidden": "Тиждень 7: Максиму знадобиться тиждень вихідних. Тиждень 9: Імпорт CSV крашнеться під час демо."
          }
        },
        {
          "id": "C",
          "title": "Домовитися про MVP-версію",
          "description": "Запропонувати: підтримка лише одного формату CSV, без UI валідації, ручна обробка помилок для пілота.",
          "shortConsequence": "Технічний борг, але швидше",
          "consequences": {
            "immediate": "Девід погоджується на \"базову версію\". Яна будує її за 5 днів — один формат, мінімальна валідація. Клієнт може користуватися, але система вразлива. Техборг створено, але графік захищено. Команда відчуває, що ви знайшли золоту середину.",
            "metrics": {
              "clientTrust": 5,
              "teamMood": 5,
              "techDebt": -15,
              "timelineRisk": -5
            },
            "hidden": "Тиждень 8: Імпорт CSV спричинить баги інтеграції. Тиждень 12: Все ще нестабільно під час демо."
          }
        },
        {
          "id": "D",
          "title": "Поставити під сумнів потребу клієнта",
          "description": "Запитати Девіда: цей клієнт вже готовий платити? Чи просто \"цікавиться\"? Чи можуть вони почати без імпорту?",
          "shortConsequence": "Може здатися, що ви блокуєте продажі",
          "consequences": {
            "immediate": "Девід визнає, що клієнт \"дуже зацікавлений\", але ще не підписався. Ви пропонуєте: запуск без CSV, додамо у Фазі 2. Девід неохоче погоджується. Команда видихнула. Але через 2 тижні клієнт йде до конкурента з CSV. Девід втрачає віру у ваші рішення.",
            "metrics": {
              "clientTrust": -25,
              "teamMood": 10,
              "techDebt": 5,
              "timelineRisk": 10
            },
            "hidden": "Тиждень 6: Девід буде частіше ігнорувати ваші рішення. Мікроменеджмент посилюється."
          }
        }
      ]
    },
    {
      "weekNumber": 4,
      "phase": "Розробка",
      "title": "Тихий блокер",
      "context": "Ви обрали свій шлях минулого тижня. Олена була тихою... (Контекст дублюється у вихідному файлі). Максим втратив 3 дні, чекаючи на ендпоінт, який не буде готовий ще тиждень. Яна заблокована зовнішнім схваленням. Спринт зривається. Ніхто не повідомив про проблему раніше.",
      "signals": [
        {
          "from": "Максим (Frontend)",
          "time": "2:47 PM",
          "avatar": "💻",
          "message": "Так, я думав почекати на реальний ендпоінт. Мок-дані — це подвійна робота. Але можу переключитися, якщо треба."
        },
        {
          "from": "Яна (Backend)",
          "time": "3:01 PM",
          "avatar": "⚙️",
          "message": "Я заблокована на тестуванні Stripe webhooks. Не можу рухатися далі, поки не схвалять тестовий аккаунт. Чекаю на Девіда."
        },
        {
          "from": "Девід Чен (CEO)",
          "time": "5:32 PM",
          "avatar": "👔",
          "message": "Тестовий аккаунт Stripe? Я думав, він у нас є. Зараз перевірю. Можливо, завтра."
        },
        {
          "from": "Андрій (QA)",
          "time": "6:15 PM",
          "avatar": "🧪",
          "message": "(повідомлень немає, але завдання в Jira позначені як \"Очікує розробки\")"
        }
      ],
      "situation": "Команда не ескалювала проблеми вчасно. Кожен думав, що воно вирішиться саме собою.",
      "options": [
        {
          "id": "A",
          "title": "Пропустити це, фокус на наступний спринт",
          "description": "Прийняти втрату часу, не створювати драми, переглянути очікування на наступний тиждень.",
          "shortConsequence": "Команда нічому не вчиться щодо ранньої ескалації",
          "consequences": {
            "immediate": "Ви вирішуєте не робити з цього проблему. Спринт закінчується з мінімальним результатом. Команда готується до наступного тижня. Але патерн повторюється — люди чекають занадто довго. Тиждень 7 матиме ту саму проблему.",
            "metrics": {
              "clientTrust": -5,
              "teamMood": 0,
              "techDebt": 0,
              "timelineRisk": -10
            }
          }
        },
        {
          "id": "B",
          "title": "Запровадити щоденні стендапи",
          "description": "Вимагати 15-хвилинну щоденну синхронізацію, щоб ловити блокери раніше.",
          "shortConsequence": "Додає зайвих зустрічей, може відчуватися як мікроменеджмент",
          "consequences": {
            "immediate": "Ви оголошуєте щоденні стендапи з понеділка. Максим злегка закочує очі. Яна нейтральна. Команда відчуває, що ви їм не довіряєте. Але блокери випливають швидше. Тиждень 6: ви ловите критичну проблему з API на 2 дні раніше.",
            "metrics": {
              "clientTrust": 0,
              "teamMood": -10,
              "techDebt": 5,
              "timelineRisk": 10
            }
          }
        },
        {
          "id": "C",
          "title": "Створити протокол \"заблоковано\"",
          "description": "Встановити правило: якщо заблокований >4 годин — ескалюй негайно, без сорому.",
          "shortConsequence": "Культурні зміни, потребує часу на звикання",
          "consequences": {
            "immediate": "Ви створюєте Slack-канал #blockers. Максим і Яна погоджуються, що це розумно. Потрібно 2 тижні, щоб звичка закріпилася, але до 7-го тижня вони ескалюють проблеми вчасно. Ви економите 5 днів сумарно.",
            "metrics": {
              "clientTrust": 0,
              "teamMood": 5,
              "techDebt": 0,
              "timelineRisk": 15
            }
          }
        },
        {
          "id": "D",
          "title": "Провести 1-на-1 з Максимом та Яною",
          "description": "Приватно поговорити про збій у комунікації, без публічних звинувачень.",
          "shortConsequence": "Лікує симптоми, а не систему",
          "consequences": {
            "immediate": "Ви проводите окремі розмови. Обидва вибачаються і обіцяють краще комунікувати. Це працює для цього спринту, але на 8-му тижні у Олени стається така ж проблема. Система не змінилася.",
            "metrics": {
              "clientTrust": 0,
              "teamMood": 10,
              "techDebt": 0,
              "timelineRisk": 0
            }
          }
        }
      ]
    },
    {
      "weekNumber": 5,
      "phase": "Розробка",
      "title": "Тихий бунт",
      "context": "Тиждень починається нормально. Андрій проводить тестування і знаходить 12 багів у дашборді. Критичні: дані не оновлюються, фільтри не працюють.\n\nМаксим відповідає: \"Я знаю, вони в трекері. Виправлю, коли закінчу сторінку аналітики\".\n\nАндрій наполягає: \"Але демо через 7 тижнів. Якщо не виправити зараз, вони накопичаться\". Максим ігнорує і продовжує працювати над новими фічами.",
      "signals": [
        {
          "from": "Андрій (QA)",
          "time": "10:42 AM",
          "avatar": "🧪",
          "message": "Мені продовжувати тестувати чи чекати на фікси? Я знаходжу баги швидше, ніж їх виправляють."
        },
        {
          "from": "Максим (Frontend)",
          "time": "11:18 AM",
          "avatar": "💻",
          "message": "Давайте баги зробимо на тижні очищення. Зараз мені треба шипити фічі, інакше не буде чого показувати."
        },
        {
          "from": "Яна (Backend)",
          "time": "1:25 PM",
          "avatar": "⚙️",
          "message": "Я згодна з Максимом. Ми ще не закінчили функціонал. Баги неминучі."
        },
        {
          "from": "Олена (Дизайнер)",
          "time": "3:04 PM",
          "avatar": "🎨",
          "message": "Я бачу баги в дизайні, який я здала. Це виглядає зламаним. На демо це буде виглядати жахливо."
        }
      ],
      "situation": "Філософський розкол. Розробники хочуть швидкість фіч. QA та Дизайнер хочуть якість. Обидві сторони праві. Що оберете ви?",
      "options": [
        {
          "id": "A",
          "title": "Фриз фіч, виправлення багів",
          "description": "Зупинити розробку нового на 1 тиждень, закрити існуючі борги.",
          "shortConsequence": "Якість покращиться, але фічі затримаються",
          "consequences": {
            "immediate": "Ви оголошуєте фриз. Максим незадоволений, але виконує. За тиждень дашборд стає стабільним. Виправлено 10 з 12 багів. Але тепер ви відстаєте на тиждень. На 9-му тижні доведеться щось вирізати.",
            "metrics": {
              "clientTrust": 0,
              "teamMood": -5,
              "techDebt": 15,
              "timelineRisk": -10
            }
          }
        },
        {
          "id": "B",
          "title": "Продовжувати фічі, прийняти баги",
          "description": "Сказати Андрію логувати проблеми, виправимо в останні тижні.",
          "shortConsequence": "Техборг росте, може не вистачити часу пізніше",
          "consequences": {
            "immediate": "Максим швидко рухається по фічах. До 8-го тижня у вас 47 багів. На 11-му тижні у вас лише 3 дні на все. Продукт на демо буде нестабільним.",
            "metrics": {
              "clientTrust": 5,
              "teamMood": 5,
              "techDebt": -25,
              "timelineRisk": -15
            }
          }
        },
        {
          "id": "C",
          "title": "Паралельні треки",
          "description": "Максим робить фічі, Андрій сам фіксить прості баги (базовий фронтенд).",
          "shortConsequence": "Андрій виходить за межі ролі, можливі конфлікти",
          "consequences": {
            "immediate": "Андрій намагається допомогти, але його фікси створюють 3 нових баги. Максим обурений: \"Хто чіпав мій код?\". Напруга в команді зростає.",
            "metrics": {
              "clientTrust": 0,
              "teamMood": -15,
              "techDebt": -10,
              "timelineRisk": 0
            }
          }
        },
        {
          "id": "D",
          "title": "Узгоджена пропорція",
          "description": "Кожен спринт: 70% фічі, 30% баги. Компроміс.",
          "shortConsequence": "Ніхто не задоволений повністю, але є баланс",
          "consequences": {
            "immediate": "Ви впроваджуєте ліміт. Кількість багів тримається під контролем. Якість демо буде прийнятною. Команда вважає компроміс справедливим.",
            "metrics": {
              "clientTrust": 0,
              "teamMood": 5,
              "techDebt": 5,
              "timelineRisk": 0
            }
          }
        }
      ]
    },
    {
      "weekNumber": 6,
      "phase": "Разробка",
      "title": "Сумніви засновника",
      "context": "Девід викликає вас на 1-на-1. Він виглядає розгубленим. Каже, що спілкувався з клієнтами, і вони хочуть Slack-інтеграцію, вайт-лейбл, API... Він запитує: \"А якщо ми будуємо не те? Може, півот?\"",
      "signals": [
        {
          "from": "Девід Чен (CEO)",
          "time": "4:15 PM",
          "avatar": "👔",
          "message": "Не кажи поки команді. Але я не впевнений. Конкурент запустив вайт-лейбл вчора. Ми виглядаємо обмеженими."
        },
        {
          "from": "Яна (Backend)",
          "time": "(не знає про сумніви Девіда)",
          "avatar": "⚙️",
          "message": "Імпорт CSV готовий. Переходжу до аналітичного двигуна. Має бути готово до понеділка."
        },
        {
          "from": "Олена (Дизайнер)",
          "time": "(не знає)",
          "avatar": "🎨",
          "message": "Дизайни сторінки налаштувань готові. Дай знати, коли зможеш переглянути."
        },
        {
          "from": "Максим (Frontend)",
          "time": "(не знає)",
          "avatar": "💻",
          "message": "Дашборд виглядає круто. Виправив 8 багів цього тижня. Можемо завтра подивитися разом?"
        }
      ],
      "situation": "У Девіда криза впевненості. Команда працює добре. Якщо сказати їм — моральний дух впаде. Якщо ні — ризикуєте будувати непотрібне.",
      "options": [
        {
          "id": "A",
          "title": "Підтримати його занепокоєння",
          "description": "Погодитися на дослідження півоту, зупинити розробку.",
          "shortConsequence": "Команда стопається, втрата 2+ тижнів, демо провалено",
          "consequences": {
            "immediate": "Ви витрачаєте 2 тижні на інтерв'ю. Висновок: початковий напрямок був правильним. Ви втратили час і довіру команди. Графік зірвано.",
            "metrics": {
              "clientTrust": -15,
              "teamMood": -25,
              "techDebt": 0,
              "timelineRisk": -30
            }
          }
        },
        {
          "id": "B",
          "title": "Кинути виклик півоту",
          "description": "Сказати Девіду, що зміна курсу зараз — це самогубство. Нагадати про інвесторів.",
          "shortConsequence": "Може погіршити стосунки, але захистить проєкт",
          "consequences": {
            "immediate": "Девід поважає вашу прямолінійність. Команда продовжує роботу. Але Девід тепер частіше перевіряє ваші рішення.",
            "metrics": {
              "clientTrust": -10,
              "teamMood": 10,
              "techDebt": 0,
              "timelineRisk": 5
            }
          }
        },
        {
          "id": "C",
          "title": "Запропонувати компроміс",
          "description": "Будувати ядро як планували, але додати API як бонус, якщо встигнемо.",
          "shortConsequence": "Звучить логічно, але часу не вистачить",
          "consequences": {
            "immediate": "Девід заспокоюється. Але на 10-му тижні стає ясно, що часу на API немає. Девід розчарований, відчуває себе обманутим.",
            "metrics": {
              "clientTrust": -5,
              "teamMood": 0,
              "techDebt": 0,
              "timelineRisk": -5
            }
          }
        },
        {
          "id": "D",
          "title": "Виграти час",
          "description": "Попросити його дотримуватися плану до 9-го тижня, потім вирішити. Дати продукту шанс.",
          "shortConsequence": "Відкладає рішення, тримає темп",
          "consequences": {
            "immediate": "На 9-му тижні продукт виглядає настільки добре, що сумніви Девіда зникають. Кризу подолано.",
            "metrics": {
              "clientTrust": 0,
              "teamMood": 5,
              "techDebt": 0,
              "timelineRisk": 0
            }
          }
        }
      ]
    },
    {
      "weekNumber": 7,
      "phase": "Розробка",
      "title": "Перевтомлений розробник",
      "context": "П'ятниця, 19:00. Максим іде офлайн. Ви перевіряєте сторінку аналітики: фільтри дати ламаються, експорт не працює. Максим каже, що вигорів і хоче вихідні. Девід планує показати демо в понеділок вранці.",
      "signals": [
        {
          "from": "Максим (Frontend)",
          "time": "10:32 AM Субота",
          "avatar": "💻",
          "message": "Вибач, я більше не можу. Потрібні вихідні. Виправлю в понеділок, обіцяю."
        },
        {
          "from": "Яна (Backend)",
          "time": "12:15 PM Субота",
          "avatar": "⚙️",
          "message": "Можу глянути бекенд-частину, якщо треба. Але я теж втомилася."
        },
        {
          "from": "Девід Чен (CEO)",
          "time": "3:47 PM Субота",
          "avatar": "👔",
          "message": "Планую показати аналітику клієнту в понеділок. Надсилаю лінк у неділю ввечері. Все ок?"
        }
      ],
      "situation": "Максим вигорів. Девід хоче демо. Продукт зламаний. Ваш вибір?",
      "options": [
        {
          "id": "A",
          "title": "Попросити Максима попрацювати",
          "description": "Пояснити терміновість, попросити 4 години в суботу.",
          "shortConsequence": "Він зробить, але затаїть образу",
          "consequences": {
            "immediate": "Демо врятовано, але Максим починає шукати іншу роботу.",
            "metrics": {
              "clientTrust": 10,
              "teamMood": -20,
              "techDebt": 5,
              "timelineRisk": 0
            }
          }
        },
        {
          "id": "B",
          "title": "Виправити самому",
          "description": "Ви маєте технічний досвід. Витратити неділю на фікси.",
          "shortConsequence": "Вихід за межі ролі, можете щось зламати",
          "consequences": {
            "immediate": "Ви фіксите одне, але ламаєте інше. Максим ображений, що ви залізли в його код.",
            "metrics": {
              "clientTrust": 5,
              "teamMood": -15,
              "techDebt": -10,
              "timelineRisk": 0
            }
          }
        },
        {
          "id": "C",
          "title": "Сказати Девіду відкласти демо",
          "description": "Чесно пояснити ситуацію, надіслати лінк у понеділок вдень.",
          "shortConsequence": "Чесно, але Девід може втратити довіру",
          "consequences": {
            "immediate": "Девід незадоволений, але приймає. Максим спокійно фіксить у понеділок. Девід тепер сумнівається у ваших термінах.",
            "metrics": {
              "clientTrust": -10,
              "teamMood": 10,
              "techDebt": 0,
              "timelineRisk": 0
            }
          }
        },
        {
          "id": "D",
          "title": "Відпустити ситуацію",
          "description": "Надіслати як є, сказати Девіду \"в процесі\".",
          "shortConsequence": "Девід показує зламаний продукт",
          "consequences": {
            "immediate": "Клієнт бачить баги, каже \"ще зарано\". Девід розлючений і звинувачує вас.",
            "metrics": {
              "clientTrust": -25,
              "teamMood": 0,
              "techDebt": 0,
              "timelineRisk": -15
            }
          }
        }
      ]
    },
    {
      "weekNumber": 8,
      "phase": "Розробка",
      "title": "Пекло інтеграції",
      "context": "Фічі працюють окремо, але разом — все ламається. Оплата блокує імпорт, дашборд показує кашу. Андрій каже, що у нього 47 відкритих багів, і 23 з них — це проблеми взаємодії систем.",
      "signals": [
        {
          "from": "Яна (Backend)",
          "time": "11:52 AM",
          "avatar": "⚙️",
          "message": "Ось чому я казала про системний дизайн. Тепер ми латаємо дірки, про які не думали."
        },
        {
          "from": "Максим (Frontend)",
          "time": "1:18 PM",
          "avatar": "💻",
          "message": "Я не можу фіксити UI, якщо бекенд непередбачуваний."
        },
        {
          "from": "Андрій (QA)",
          "time": "2:40 PM",
          "avatar": "🧪",
          "message": "Я перестаю логувати все підряд, фокусуюся на головному шляху. Це хаос."
        }
      ],
      "situation": "У вас 4 тижні. Продукт крихкий. Всі звинувачують процес. Потрібне рішення.",
      "options": [
        {
          "id": "A",
          "title": "Спринт інтеграції",
          "description": "Наступний тиждень — тільки фікси взаємодій. Ніяких нових фіч.",
          "shortConsequence": "Правильно, але втрачаєте час на фічі",
          "consequences": {
            "immediate": "Продукт стає стабільним. Але доведеться відмовитися від управління користувачами.",
            "metrics": {
              "clientTrust": -5,
              "teamMood": 10,
              "techDebt": 20,
              "timelineRisk": -10
            }
          }
        },
        {
          "id": "B",
          "title": "Пріоритет на 'Critical Path'",
          "description": "Визначити 3-4 головні сценарії, зробити їх ідеальними, ігнорувати інше.",
          "shortConsequence": "Демо пройде добре, але продукт залишиться дірявим",
          "consequences": {
            "immediate": "Інвестори вражені, бо ви ведете їх по ідеальному шляху. Але продукт не готовий до реальних юзерів.",
            "metrics": {
              "clientTrust": 10,
              "teamMood": 0,
              "techDebt": -15,
              "timelineRisk": 5
            }
          }
        },
        {
          "id": "C",
          "title": "Розділяй і володарюй",
          "description": "Яна фіксить бекенд, Максим фронтенд, не чекаючи один на одного.",
          "shortConsequence": "Паралельно, але багато конфліктів у коді",
          "consequences": {
            "immediate": "Вони фіксять одне й те саме по-різному. Витрачаєте 2 дні на розгрібання конфліктів мерджу.",
            "metrics": {
              "clientTrust": 0,
              "teamMood": -10,
              "techDebt": -5,
              "timelineRisk": -10
            }
          }
        },
        {
          "id": "D",
          "title": "Скоротити обсяг ретроактивно",
          "description": "Вирізати імпорт CSV, щоб спростити інтеграцію.",
          "shortConsequence": "Втрата фічі, яку Девід обіцяв",
          "consequences": {
            "immediate": "Девід шокований, але погоджується. Кількість багів падає, але стосунки з клієнтом під загрозою.",
            "metrics": {
              "clientTrust": -15,
              "teamMood": 15,
              "techDebt": 15,
              "timelineRisk": 10
            }
          }
        }
      ]
    },
    {
      "weekNumber": 9,
      "phase": "Деплой та Стабілізація",
      "title": "Катастрофічне демо",
      "context": "Внутрішнє демо для ради директорів. Помилка Stripe, неправильні цифри на дашборді, кнопка експорту фризить сторінку. Девід каже: \"Ми все виправимо за 3 тижні\". Члени ради мовчать.",
      "signals": [
        {
          "from": "Девід Чен (CEO)",
          "time": "11:47 AM",
          "avatar": "👔",
          "message": "Що сталося? Це було жахливо. У нас 3 тижні, щоб все виправити, або ми трупи."
        },
        {
          "from": "Яна (Backend)",
          "time": "12:15 PM",
          "avatar": "⚙️",
          "message": "Таймаут Stripe плаваючий. Не можу відтворити стабільно."
        }
      ],
      "situation": "Рада втратила віру. Потрібні радикальні кроки для ідеального демо через 3 тижні.",
      "options": [
        {
          "id": "A",
          "title": "Негайний фриз фіч",
          "description": "Тільки стабільність і репетиції демо.",
          "shortConsequence": "Демо пройде ідеально, але фіч буде менше",
          "consequences": {
            "immediate": "Інвестори помічають відсутність фіч, дають гроші, але оцінка компанії нижча.",
            "metrics": {
              "clientTrust": 5,
              "teamMood": -5,
              "techDebt": 25,
              "timelineRisk": 20
            }
          }
        },
        {
          "id": "B",
          "title": "Переписати 'Critical Path'",
          "description": "Яна переписує інтеграцію Stripe, ви тестуєте до посиніння.",
          "shortConsequence": "Може виправити корінь зла, але занадто ризиковано",
          "consequences": {
            "immediate": "Ви не спите 48 годин перед демо. Воно працює, але команда знищена морально.",
            "metrics": {
              "clientTrust": 0,
              "teamMood": -25,
              "techDebt": 10,
              "timelineRisk": -20
            }
          }
        },
        {
          "id": "C",
          "title": "Додати моніторинг та 'фалбеки'",
          "description": "Приховати баги за допомогою обробки помилок та повторних спроб.",
          "shortConsequence": "Не лікує хворобу, лише симптоми",
          "consequences": {
            "immediate": "Демо виглядає гладким, бо система сама перепідключається при збоях. Але продукт залишається крихким.",
            "metrics": {
              "clientTrust": 10,
              "teamMood": 0,
              "techDebt": -15,
              "timelineRisk": 5
            }
          }
        },
        {
          "id": "D",
          "title": "Найняти зовнішню допомогу",
          "description": "Залучити контрактника на 2 тижні для фіксів.",
          "shortConsequence": "Коштує грошей, б'є по самолюбству команди",
          "consequences": {
            "immediate": "Контрактник фіксить баги, але вносить інший стиль коду. Яна ображена.",
            "metrics": {
              "clientTrust": 5,
              "teamMood": -15,
              "techDebt": -10,
              "timelineRisk": 10
            }
          }
        }
      ]
    },
    {
      "weekNumber": 10,
      "phase": "Деплой та Стабілізація",
      "title": "Опівнічне повідомлення",
      "context": "Вівторок, 23:47. Яна пише, що Stripe оновив API, і наша інтеграція зламана для нових акаунтів. Перехід на нову версію — це 3-4 дні роботи з ризиком зламати все інше.",
      "signals": [
        {
          "from": "Яна (Backend)",
          "time": "12:15 AM",
          "avatar": "⚙️",
          "message": "Я мала помітити це раніше. Їхній чейнджлог був глибоко захований."
        }
      ],
      "situation": "До демо 13 днів. Ризикуємо переходом на v2 чи сподіваємося на везіння зі старим акаунтом?",
      "options": [
        {
          "id": "A",
          "title": "Мігрувати негайно",
          "description": "Яна працює вихідні, виділяємо 4 дні.",
          "shortConsequence": "Правильно в довгу, ризиковано в коротку",
          "consequences": {
            "immediate": "Ви встигаєте, але команда виснажена. Буфера часу більше немає.",
            "metrics": {
              "clientTrust": 0,
              "teamMood": -15,
              "techDebt": 20,
              "timelineRisk": -15
            }
          }
        },
        {
          "id": "B",
          "title": "Зробити 'патч' для v1",
          "description": "Швидкий хак, щоб v1 працював для демо.",
          "shortConsequence": "Жахливий техборг, але безпечно для демо",
          "consequences": {
            "immediate": "Хак працює. Ви отримали фінансування, але пізніше цей костиль вилізе боком.",
            "metrics": {
              "clientTrust": 5,
              "teamMood": 0,
              "techDebt": -20,
              "timelineRisk": 10
            }
          }
        },
        {
          "id": "C",
          "title": "Використати старий акаунт",
          "description": "Нічого не чіпати. Сподіватися, що на демо не створюватимуть нових акаунтів.",
          "shortConsequence": "Демо працює, але продукт зламаний для нових юзерів",
          "consequences": {
            "immediate": "Все проходить супер. Але перший реальний клієнт після демо відразу відвалюється.",
            "metrics": {
              "clientTrust": 10,
              "teamMood": 5,
              "techDebt": -25,
              "timelineRisk": 5
            }
          }
        },
        {
          "id": "D",
          "title": "Сказати Девіду зараз",
          "description": "Розбудити його, нехай вирішує сам.",
          "shortConsequence": "Ескалація рішення, але можлива паніка",
          "consequences": {
            "immediate": "Девід панікує, міняє рішення кожну годину. Ви втрачаєте час на його заспокоєння.",
            "metrics": {
              "clientTrust": -15,
              "teamMood": -10,
              "techDebt": -10,
              "timelineRisk": 0
            }
          }
        }
      ]
    },
    {
      "weekNumber": 11,
      "phase": "Деплой та Стабілізація",
      "title": "Останній ривок",
      "context": "Середа. Демо в п'ятницю. Андрій знаходить некритичний, але помітний баг: при відключенні Stripe дані не зникають. Максим може пофіксити за 3 години, але потрібен редеплой і ретест.",
      "signals": [
        {
          "from": "Андрій (QA)",
          "time": "9:42 AM",
          "avatar": "🧪",
          "message": "Баг не смертельний. Але якщо інвестор спробує відключити-підключити Stripe, він побачить старі дані."
        },
        {
          "from": "Яна (Backend)",
          "time": "10:18 AM",
          "avatar": "⚙️",
          "message": "Я проти. Зараз все стабільно. Не чіпайте прод перед демо."
        }
      ],
      "situation": "Ризикувати стабільністю заради дрібного фікса за 24 години до фінішу?",
      "options": [
        {
          "id": "A",
          "title": "Виправити і задеплоїти зараз",
          "description": "Максим фіксить, деплой у четвер по обіді.",
          "shortConsequence": "Чистий продукт, але ризик зламати все",
          "consequences": {
            "immediate": "Деплой ламає щось у Safari. Ви сидите до 2 ранку. Демо працює, але ви як зомбі.",
            "metrics": {
              "clientTrust": 5,
              "teamMood": -20,
              "techDebt": 5,
              "timelineRisk": -10
            }
          }
        },
        {
          "id": "B",
          "title": "Нічого не чіпати",
          "description": "Лишити баг, попередити Девіда не клацати туди.",
          "shortConsequence": "Стабільно, але потребує 'сценарію' демо",
          "consequences": {
            "immediate": "Все проходить ідеально. Інвестори туди не лізуть. Команда вдячна за спокій.",
            "metrics": {
              "clientTrust": 0,
              "teamMood": 10,
              "techDebt": -5,
              "timelineRisk": 10
            }
          }
        },
        {
          "id": "C",
          "title": "Виправити, але не деплоїти",
          "description": "Фікс тільки в дев-гілці, деплой після демо.",
          "shortConsequence": "Не допомагає демо, але створює видимість роботи",
          "consequences": {
            "immediate": "Інвестор таки клацає 'відключити'. Девід викручується, каже що це 'фіча логів'. Пощастило.",
            "metrics": {
              "clientTrust": -5,
              "teamMood": 0,
              "techDebt": 0,
              "timelineRisk": 0
            }
          }
        },
        {
          "id": "D",
          "title": "Нехай Девід вирішує",
          "description": "Це його демо, хай бере відповідальність.",
          "shortConsequence": "Знімає відповідальність, але стресує замовника",
          "consequences": {
            "immediate": "Девід не може вирішити, марнує 3 години вашого часу. Зрештою деплоїте в ніч.",
            "metrics": {
              "clientTrust": -5,
              "teamMood": -10,
              "techDebt": 0,
              "timelineRisk": -5
            }
          }
        }
      ]
    },
    {
      "weekNumber": 12,
      "phase": "Завершення",
      "title": "Демо",
      "context": "П'ятниця, 14:00. Вісім людей у Zoom. Ви шерите екран. Все йде як по маслу. Реєстрація, Stripe, аналітика — жодного лагу. Інвестор запитує про управління користувачами. Девід спокійно каже: \"Це в наступному спринті\". Інвестор киває. Гроші ваші.",
      "signals": [
        {
          "from": "Девід Чен (CEO)",
          "time": "4:27 PM",
          "avatar": "👔",
          "message": "Ми це зробили. Дякую. Серйозно. Я знаю, це було жорстко."
        },
        {
          "from": "Яна (Backend)",
          "time": "4:45 PM",
          "avatar": "⚙️",
          "message": "Серія B? Ого. Після такого хаосу..."
        }
      ],
      "situation": "Успіх. Але продукт тримається на скотчі. Девід захоче нові фічі вже з понеділка. Команді потрібен відпочинок, коду — рефакторинг.",
      "options": [
        {
          "id": "A",
          "title": "Наполягати на спринті стабілізації",
          "description": "2 тижні на технічний борг.",
          "shortConsequence": "Правильно, але втрата темпу",
          "consequences": {
            "immediate": "Девід дає 1 тиждень. Команда трохи видихнула, код став кращим.",
            "metrics": {
              "clientTrust": -5,
              "teamMood": 15,
              "techDebt": 15,
              "timelineRisk": 5
            }
          }
        },
        {
          "id": "B",
          "title": "Користуватися моментом",
          "description": "Одразу нові фічі, борг потім.",
          "shortConsequence": "Вигорання та звільнення",
          "consequences": {
            "immediate": "Яна звільняється через місяць. Весь проєкт доводиться переписувати з нуля.",
            "metrics": {
              "clientTrust": 10,
              "teamMood": -30,
              "techDebt": -30,
              "timelineRisk": -25
            }
          }
        },
        {
          "id": "C",
          "title": "Гібридний варіант",
          "description": "Тиждень відпочинку, тиждень чистки, потім ріст.",
          "shortConsequence": "Компроміс, який усіх влаштовує",
          "consequences": {
            "immediate": "Команда повернулася заряжена. Ви знайшли баланс.",
            "metrics": {
              "clientTrust": 0,
              "teamMood": 20,
              "techDebt": 10,
              "timelineRisk": 0
            }
          }
        },
        {
          "id": "D",
          "title": "Дати команді вирішити",
          "description": "Запитати їх, що їм зараз потрібно.",
          "shortConsequence": "Максимальна лояльність",
          "consequences": {
            "immediate": "Вони просять 2 тижні. Девід погоджується, бо він на ейфорії. Команда тепер за вас у вогонь і воду.",
            "metrics": {
              "clientTrust": -5,
              "teamMood": 25,
              "techDebt": 10,
              "timelineRisk": 5
            }
          }
        }
      ]
    }
  ],
  "finalReview": {
    "outcomeTitle": "Демо пройшло успішно. Але...",
    "outcomeText": "MVP запущено. Демо спрацювало. Фінансування серії B залучено.\n\nАле продукт, який ви показали, не був тим продуктом, що реально працює в продакшені. Ви продемонстрували ідеальні сценарії в контрольованих умовах. Інвестори побачили потенціал, а не реальність.\n\nКоманда зробила неможливе. Вони працювали ночами. Вони жертвували якістю. Вони будували костилі замість рішень. Вони казали \"так\", коли мали на увазі \"можливо, якщо пощастить\".\n\nПрихована ціна: технічний борг, на розгрібання якого піде 3 місяці. Виснажена команда. Код, який ніхто вже до кінця не розуміє. І засновник, який впевнений, що ви можете повторити це знову, ще швидше.",
    "reflectionTitle": "Це і є Project Management",
    "reflectionText": "Не та версія, про яку розповідають на конференціях. Справжня.\n\nВи не програли. Але й не перемогли чисто.\n\nВи прийняли дванадцять рішень. Більшість з них були розумними в конкретний момент. Але рішення мають накопичувальний ефект. Кожен компроміс був кредитом у майбутнього. Кожне \"так\" швидкості було символічним \"ні\" стабільності.\n\nКоманда не звинувачує вас. Вони зробили те, що ви просили. Вони довіряють вам. Але довіра — це також ресурс. І ви його майже вичерпали.\n\nНаступна фаза починається в понеділок. Девід чекає прискорення. Команда чекає відпочинку. Код чекає рефакторингу. Ви не можете дати всім те, чого вони хочуть.\n\nІ це та правда, про яку ніхто не пише в ретроспективах."
  }
}